In [50]:
# Задание 2.3
# Напишите функцию delete_columns(df, col=[]), которая удаляет столбцы из DataFrame и возвращает новую таблицу. 
# Если одного из указанных столбцов не существует в таблице, то функция должна возвращать None.
import pandas as pd
customer_df = pd.DataFrame({
    'number': [0, 1, 2, 3, 4],
    'cust_id': [128, 1201, 9832, 4392, 7472],
    'cust_age': [13, 21, 19, 21, 60],
    'cust_sale': [0, 0, 0.2, 0.15, 0.3],
    'cust_year_birth': [2008, 2000, 2002, 2000, 1961],
    'cust_order': [1400, 14142, 900, 1240, 8430]
})

def delete_columns(df, col=[]):
    # Проверяем, что все указанные столбцы существуют в DataFrame
    for column in col:
        if column not in df.columns:
            return None
    # Если все столбцы существуют, удаляем их и возвращаем новый DataFrame
    return df.drop(col, axis=1)

print(delete_columns(customer_df, ['number', 'cust_sale']))

   cust_id  cust_age  cust_year_birth  cust_order
0      128        13             2008        1400
1     1201        21             2000       14142
2     9832        19             2002         900
3     4392        21             2000        1240
4     7472        60             1961        8430

In [51]:
# Задание 2.4
# Задан DataFrame countries_df, содержащий следующие столбцы: название страны, население (population) в миллионах человек и площадь страны (area) в квадратных километрах.

# Для каждой страны рассчитайте плотность населения (количество человек на квадратный километр).
# Затем по полученным данным рассчитайте среднее по плотностям населения в указанных странах. Ответ округлите до сотых.
# Плотность населения рассчитывается как количество человек, проживающих на территории отдельной страны, делённое на площадь этой страны. 
# Обратите внимание, что население в таблице представлено в миллионах.

import pandas as pd
countries_df = pd.DataFrame({
    'country': ['Англия', 'Канада', 'США', 'Россия', 'Украина', 'Беларусь', 'Казахстан'],
    'population': [56.29, 38.05, 322.28, 146.24, 45.5, 9.5, 17.04],
    'area': [133396, 9984670, 9826630, 17125191, 603628, 207600, 2724902]
})
countries_df_mod = countries_df.copy()
mean_population = round((countries_df_mod['population']*1000000 / countries_df_mod['area']),2)

countries_df_copy_mod = countries_df_mod.assign(mean_population=mean_population)

display(countries_df_copy_mod) 
print(round(countries_df_copy_mod['mean_population'].mean(),2))

     country  population      area  mean_population
0     Англия       56.29    133396           421.98
1     Канада       38.05   9984670             3.81
2        США      322.28   9826630            32.80
3     Россия      146.24  17125191             8.54
4    Украина       45.50    603628            75.38
5   Беларусь        9.50    207600            45.76
6  Казахстан       17.04   2724902             6.25

84.93

In [149]:
# Вводные данные для выполнения заданий 3.4-3.5

# Вам представлены данные (в формате csv) об отчётах очевидцев НЛО в США за период с 1930 по 2020 год.

# В данных есть следующие признаки:

# "City" — город, где был замечен НЛО;
# "Colors Reported" — цвет объекта;
# "Shape Reported" — форма объекта;
# "State" — обозначение штата;
# "Time" — время, когда был замечен НЛО (данные отсортированы от старых наблюдений к новым). 
# Прочитайте данные, сделайте преобразование времени к формату datetime и выполните задания ниже.

import pandas as pd
ufo_reports = pd.read_csv('https://raw.githubusercontent.com/justmarkham/pandas-videos/master/data/ufo.csv', sep=',')
#Выведем первые 5 строк
ufo_reports.head()
# скопируем на всяких пожарный
ufo_reports_mod = ufo_reports.copy()
#Преобразуем дату
ufo_reports_mod['Time'] = pd.to_datetime(ufo_reports_mod['Time'])
display(ufo_reports_mod)

,City,Colors Reported,Shape Reported,State,Time
0,Ithaca,NaN,TRIANGLE,NY,1930-06-01 22:00:00
1,Willingboro,NaN,OTHER,NJ,1930-06-30 20:00:00
2,Holyoke,NaN,OVAL,CO,1931-02-15 14:00:00
3,Abilene,NaN,DISK,KS,1931-06-01 13:00:00
4,New York Worlds Fair,NaN,LIGHT,NY,1933-04-18 19:00:00
...,...,...,...,...,...
18236,Grant Park,NaN,TRIANGLE,IL,2000-12-31 23:00:00
18237,Spirit Lake,NaN,DISK,IA,2000-12-31 23:00:00
18238,Eagle River,NaN,NaN,WI,2000-12-31 23:45:00
18239,Eagle River,RED,LIGHT,WI,2000-12-31 23:45:00
18240,Ybor,NaN,OVAL,FL,2000-12-31 23:59:00

In [ ]:
# Задание 3.4
# В каком году отмечается наибольшее количество случаев наблюдения НЛО в США?

years_see = ufo_reports_mod['Time'].dt.year
display(years_see)
display(ufo_reports_mod['Time'].dt.year.value_counts()[0:3])
print('Mode year sold:', years_see.mode()[0])

0        1930
1        1930
2        1931
3        1931
4        1933
         ...
18236    2000
18237    2000
18238    2000
18239    2000
18240    2000
Name: Time, Length: 18241, dtype: int32

Time
1999    2774
2000    2635
1998    1743
Name: count, dtype: int64

Mode year sold: 1999

In [151]:
display(ufo_reports_mod['State'].value_counts())

State
CA    2529
WA    1322
TX    1027
NY     914
FL     837
AZ     738
OH     667
IL     613
PA     598
MI     591
OR     534
MO     448
NJ     370
CO     367
WI     357
NC     356
IN     326
GA     325
MA     322
VA     299
TN     286
NV     284
MN     254
KY     244
NM     241
CT     225
MD     215
AR     206
AL     193
UT     193
OK     193
ME     181
KS     176
LA     174
SC     166
IA     162
MT     144
MS     139
WV     132
ID     130
NH     125
AK     116
NE     101
HI      85
WY      69
RI      67
SD      57
ND      51
VT      44
DE      43
Fl       4
Ca       1
Name: count, dtype: int64

In [ ]:
# Задание 3.5

# Найдите средний интервал времени (в днях) между двумя последовательными случаями наблюдения НЛО в штате Невада (NV)

ufo_reports_nevada = (ufo_reports_mod[ufo_reports_mod['State'] == 'NV']).copy()
ufo_reports_nevada['Date'] = ufo_reports_nevada['Time'].dt.date
ufo_reports_nevada['Interval'] = ufo_reports_nevada['Date'].diff()
display(ufo_reports_nevada)
mean = ufo_reports_nevada['Interval'].mean()
display((mean))

,City,Colors Reported,Shape Reported,State,Time,Date,Interval
76,Las Vegas,NaN,DISK,NV,1947-07-15 10:00:00,1947-07-15,NaT
172,Nellis AFB,NaN,DISK,NV,1952-02-17 18:00:00,1952-02-17,1678 days
565,Fallon,NaN,OVAL,NV,1959-09-15 00:00:00,1959-09-15,2767 days
566,Goldfield,NaN,LIGHT,NV,1959-09-15 01:00:00,1959-09-15,0 days
613,NaN,NaN,DISK,NV,1960-07-01 12:00:00,1960-07-01,290 days
...,...,...,...,...,...,...,...
17447,Laughlin,NaN,FORMATION,NV,2000-09-16 22:00:00,2000-09-16,22 days
17567,Las Vegas,NaN,SPHERE,NV,2000-09-30 22:25:00,2000-09-30,14 days
17617,Las Vegas,RED YELLOW,OTHER,NV,2000-10-06 20:25:00,2000-10-06,6 days
17890,Reno,NaN,TRIANGLE,NV,2000-11-07 02:15:00,2000-11-07,32 days
18104,Las Vegas,NaN,TRIANGLE,NV,2000-12-10 17:30:00,2000-12-10,33 days

Timedelta('68 days 22:18:13.992932862')

In [ ]:
# Представьте, что вы занимаетесь подготовкой данных о вакансиях с платформы hh.ru. 
# В вашем распоряжении имеется таблица, в которой с помощью парсинга собраны резюме кандидатов. 
# В этой таблице есть текстовый столбец «Опыт работы». Пример такого столбца представлен ниже в виде объекта Series. Структура текста в столбце фиксирована и не может измениться.

# Напишите функцию get_experience(arg), аргументом которой является строка столбца с опытом работы. 
# Функция должна возвращать опыт работы в месяцах. Не забудьте привести результат к целому числу.

# Примечание. Обратите внимание, что опыт работы может выражаться только в годах или только в месяцах. 
# Учтите это при построении своей функции.

# При проверке мы будем применять вашу функцию к разным Series с помощью метода apply().

# Пример результата работы функции get_experience:

import pandas as np
exp = pd.Series(['Опыт работы 8 лет 3 месяца','Опыт работы 3 года 5 месяцев','Опыт работы 1 год 9 месяцев','Опыт работы 3 месяца','Опыт работы 6 лет'])




# На вход данной функции поступает строка с адресом.
def get_experience(arg):
# Метод split() разбивает строку на слова по пробелу.

# Создаём список обрезки exclude_list.
    exclude_list = ['Опыт работы ']
# Метод split() разбивает строку на слова по пробелу.
# В результате получаем список слов в строке и заносим его в переменную address_list.
    address_list = address.split(' ')
# Обрезаем список, оставляя в нём только последний элемент,
# потенциальный подтип улицы, и заносим в переменную street_type.
    street_type = address_list[-1]
# Делаем проверку на то, что полученный подтип является географической пометкой.
# Для этого проверяем его на наличие в списке exclude_list.
    if street_type in exclude_list:
# Если переменная street_type является географической пометкой,
# переопределяем её на второй элемент с конца списка address_list.
        street_type = address_list[-2]
# Возвращаем переменную street_type, в которой хранится подтип улицы.
    return street_type

display(exp)

0      Опыт работы 8 лет 3 месяца
1    Опыт работы 3 года 5 месяцев
2     Опыт работы 1 год 9 месяцев
3            Опыт работы 3 месяца
4               Опыт работы 6 лет
dtype: object